
class СмакМорозива:
    def __init__(self, назва):
        self.назва = назва


class Ваніль(СмакМорозива):
    def __init__(self):
        super().__init__("Ваніль")

class Шоколад(СмакМорозива):
    def __init__(self):
        super().__init__("Шоколад")

class Полуниця(СмакМорозива):
    def __init__(self):
        super().__init__("Полуниця")

class Банан(СмакМорозива):
     def __init__(self):
        super().__init__("Банан")


class Морозиво:
    def __init__(self):
        self.смаки = []

    def додати_смак(self, смак):
        self.смаки.append(смак)

    def вибрати_смаки(self):
        print("Доступні смаки морозива:")
        for і in range(len(self.смаки)):
            print(f"{і + 1}. {self.смаки[і].назва}")
        вибори = input("Виберіть номери смаків (через кому): ")
        вибрані_смаки = []
        try:
            номери = [int(н) for н in вибори.split(",")]
            for номер in номери:
                if 1 <= номер <= len(self.смаки):
                    вибрані_смаки.append(self.смаки[номер - 1])
                else:
                    print(f"Смак з номером {номер} не існує.")
        except ValueError:
            print("Будь ласка, введіть правильні номери смаків.")
        return вибрані_смаки


ваніль = Ваніль()
шоколад = Шоколад()
полуниця = Полуниця()
банан = Банан()


морозиво = Морозиво()
морозиво.додати_смак(ваніль)
морозиво.додати_смак(шоколад)
морозиво.додати_смак(полуниця)
морозиво.додати_смак(банан)


вибрані_смаки = морозиво.вибрати_смаки()
print("Ваше морозиво має смаки:")
for смак in вибрані_смаки:
    print(смак.назва)
